In [1]:
import pandas as pd

In [2]:
pd.__version__

'0.24.2'

In [29]:
pd.read_excel('data/Students.xlsx', header=1, usecols="B:G")

  Student_Name Gender  Age Grade_Level Grade  GPA
0        Tammy      F   17        12th     A  3.7
1       Trevor      M   16        11th    A-  3.2
2        Harry      M   16        11th     A  3.5
3        Alice      F   17        12th    B+  2.8
4       Martha      F   16        12th    A-  3.1
5          Sam      M   15        10th     A  3.9
6         Alex      M   16        11th     A  4.0
7        Emily      F   17        12th     A  3.7
8          Max      M   16        12th     A  3.6
9       Dorthy      F   16        11th    B+  2.8

In [40]:
pd.read_excel('data/Students.xlsx', sheet_name="Teacher", header=1, usecols="B:G")

  Teacher_Name Gender  Age Grade             Role  Years_Playing
0      Mike T.      M   45  12th            Coach             28
1     Kelly B.      F   38  11th  Assistant Coach              8
2       Bob C.      M   27  10th  Assistant Coach              2

In [ ]:
# Other attributes
    # skiprows
    # names
    # index_col